<a href="https://colab.research.google.com/github/yinglinglow/GA_projects/blob/master/day2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.DataFrame([['0123', 'abc inc', 1000],
             ['0456', 'def inc', 2000],
             ['0789', np.nan, 3000],
             ['1234', 'abc inc', 4000],], columns=['id', 'name', 'value'])

In [24]:
df.columns

Index(['id', 'name', 'value'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
df.shape

(4, 3)

In [27]:
df.head(2)

     id     name  value
0  0123  abc inc   1000
1  0456  def inc   2000

In [28]:
df.tail(2)

     id     name  value
2  0789      NaN   3000
3  1234  abc inc   4000

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
id       4 non-null object
name     3 non-null object
value    4 non-null int64
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [30]:
df.describe()

             value
count     4.000000
mean   2500.000000
std    1290.994449
min    1000.000000
25%    1750.000000
50%    2500.000000
75%    3250.000000
max    4000.000000

In [32]:
df.describe(include='all')

          id     name        value
count      4        3     4.000000
unique     4        2          NaN
top     0789  abc inc          NaN
freq       1        2          NaN
mean     NaN      NaN  2500.000000
std      NaN      NaN  1290.994449
min      NaN      NaN  1000.000000
25%      NaN      NaN  1750.000000
50%      NaN      NaN  2500.000000
75%      NaN      NaN  3250.000000
max      NaN      NaN  4000.000000

## Time Series

In [35]:
index = pd.DatetimeIndex(['2014-07-04', '2014-08-04',
                          '2015-07-04', '2015-08-04'])
data = pd.DataFrame([['123yr14', 1000],
                     ['234yr14', 3000],
                     ['123yr15', 2000],
                     ['234yr15', 3000]], columns=['id', 'value'], index=index)
data

                 id  value
2014-07-04  123yr14   1000
2014-08-04  234yr14   3000
2015-07-04  123yr15   2000
2015-08-04  234yr15   3000

In [37]:
data['2014']

                 id  value
2014-07-04  123yr14   1000
2014-08-04  234yr14   3000

In [38]:
data['2014-08-01':'2015-08-01']

                 id  value
2014-08-04  234yr14   3000
2015-07-04  123yr15   2000